IDEA StatiCa Open Model
ConcreteSLSCheckResultStressLimitationEc2.TypeCheck Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 type of SLS limit stress check
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public TypeSLSLimitStressCheck TypeCheck { get; set; }
Public Property TypeCheck As TypeSLSLimitStressCheck
	Get
	Set
public:
property TypeSLSLimitStressCheck TypeCheck {
	TypeSLSLimitStressCheck get ();
	void set (TypeSLSLimitStressCheck value);
}
Property Value
Type: TypeSLSLimitStressCheck
See Also
Reference
ConcreteSLSCheckResultStressLimitationEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace